---
type: StructuralSectionGeneralLA
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 2
tags: [revit-api, class]
---

# StructuralSectionGeneralLA

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralLA | 2018 | `public StructuralSectionGeneralLA ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double lipLength , double centroidHorizontal , double centroidVertical , ` |
| Property | LipLength | 2018 | `public double LipLength { get ; set ; }` |